# Week 4: Python + Some More Pandas

Select your Kernel!

### 1 - Imports

In [9]:
import pandas as pd

data = {
    'Name': ['Zophie', 'Alice', 'Bob', 'Charlie', 'Max', 'Milo', 'Luna', 'Bella'],
    'Age': [7, 5, 3, 2, 5, 3, 2, 5],
    'Color': ['Gray', 'Black', 'Brown', 'White', 'Black', 'Brown', 'White', 'Black'],
    'Owner': ['Charles', 'Charles', 'Cj', 'Cj', 'Cj', 'Charles', 'Cj', 'Charles'],
    'Type': ['Cat', 'Cat', 'Dog', 'Dog', 'Dog', 'Cat', 'Dog', 'Cat']
}

### 2 - Python Control Flow

In [10]:
# Example For Loop

for i in range(1,10,1):
    print(i)
    
# Write a for loop to print even numbers between -4 to 40
for i in range(-4,42,2):
    print(i)

1
2
3
4
5
6
7
8
9
-4
-2
0
2
4
6
8
10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40

In [15]:
# Example if/else if/else clause

g = int(input("Enter a number"))

if g < 0:
    print("Neg")
elif g < 10:
    print("Small")
else:
    print("Large asf!")
    
# Write an for + if/else clause that checks if pets are older/younger than 4
# Note that length of data isn't len(data) but len(data['Name])
for i in range(len(data['Name'])):
    status = ""
    name = data['Name'][i]
    age = data['Age'][i]
    if age > 4: 
        status = "older than 4" 
    else: 
        status = "younger than or equal to 4"
    print(f"{name} is {status}")

# Do the same by converting to a dataframe and using 
df = pd.DataFrame(data)
df['Age Status'] = df['Age'].apply(lambda age: 'older than 4' if age > 4 else 'younger than or equal to 4')
df

Small
Zophie is older than 4
Alice is older than 4
Bob is younger than or equal to 4
Charlie is younger than or equal to 4
Max is older than 4
Milo is younger than or equal to 4
Luna is younger than or equal to 4
Bella is older than 4

      Name  Age  Color    Owner Type                  Age Status
0   Zophie    7   Gray  Charles  Cat                older than 4
1    Alice    5  Black  Charles  Cat                older than 4
2      Bob    3  Brown       Cj  Dog  younger than or equal to 4
3  Charlie    2  White       Cj  Dog  younger than or equal to 4
4      Max    5  Black       Cj  Dog                older than 4
5     Milo    3  Brown  Charles  Cat  younger than or equal to 4
6     Luna    2  White       Cj  Dog  younger than or equal to 4
7    Bella    5  Black  Charles  Cat                older than 4

In [19]:
# Example While Loop
i = 0

while i < 10:
    print("I love CJ!")
    i = i + 1

colors = list(df['Color'])
# Create a while loop that goes through colors until it gets to white, then prints out index
curr = colors[0]
j = 0
while curr != "White":
    j += 1
    curr = colors[j]
print(j)

I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
3

In [25]:
# Example List Comprehension

bops = [x for x in range(1,10)]
bops

# Example map

top = list(map(lambda x: x**2, bops))
top

# Redo top but use a named function instead of lambda

def square(x):
    return x**2
tops = list(map(square, bops))
tops

[1, 4, 9, 16, 25, 36, 49, 64, 81]

3 - Pandas

In [ ]:
# Example of .split()
df = pd.DataFrame({'Full Name': ['Charlie Brown', 'Alice Smith']})
df[['First', 'Last']] = df['Full Name'].str.split(' ', expand=True)
print(df)

#

       Full Name    First   Last
0  Charlie Brown  Charlie  Brown
1    Alice Smith    Alice  Smith

In [27]:
# Example of .isin()
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']})
mask = df['Name'].isin(['Alice', 'Charlie'])
print(df[mask])

      Name
0    Alice
2  Charlie

In [28]:
# Example of .merge()
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [30, 25, 40]})

In [29]:
pd.merge(df1, df2, on='ID', how='inner')

   ID     Name  Age
0   2      Bob   30
1   3  Charlie   25

In [30]:
pd.merge(df1, df2, on='ID', how='outer')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  30.0
2   3  Charlie  25.0
3   4      NaN  40.0

In [31]:
pd.merge(df1, df2, on='ID', how='left')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  30.0
2   3  Charlie  25.0

In [32]:
pd.merge(df1, df2, on='ID', how='right')

   ID     Name  Age
0   2      Bob   30
1   3  Charlie   25
2   4      NaN   40

In [33]:
# Use all three!
customers = pd.DataFrame({
    'FullName': ['Alice Johnson', 'Bob Smith', 'Charlie Brown'],
    'Phone': ['555-1234', '555-5678', '555-9999'],
    'Email': ['alice@email.com', 'bob@email.com', 'charlie@email.com']
})

appointments = pd.DataFrame({
    'Owner': ['Bob Smith', 'Charlie Brown', 'Dana White'],
    'Pet': ['Rex', 'Whiskers', 'Bubbles'],
    'Date': ['2025-04-23', '2025-04-24', '2025-04-25']
})

# create a df that splits customers names, filters only customers with appointments, then merges
customers[['FirstName', 'LastName']] = customers['FullName'].str.split(' ', expand=True)
appointments_filtered = appointments[appointments['Owner'].isin(customers['FullName'])]
appointments_merged = pd.merge(appointments_filtered, customers, left_on='Owner', right_on='FullName', how='left')

appointments_merged

,Owner,Pet,Date,FullName,Phone,Email,FirstName,LastName
0,Bob Smith,Rex,2025-04-23,Bob Smith,555-5678,bob@email.com,Bob,Smith
1,Charlie Brown,Whiskers,2025-04-24,Charlie Brown,555-9999,charlie@email.com,Charlie,Brown